{
  "metadata": {
    "originator": "AWS",
    "shortname": "SSB",
    "fullname": "AWS Startup Security Baseline",
    "description": "The AWS Startup Security Baseline (SSB) is a set of controls that create a minimum foundation for businesses to build securely on AWS without decreasing their agility. These controls form the basis of your security posture and are focused on securing credentials, enabling logging and visibility, managing contact information, and implementing basic data boundaries.<br><br>The controls in this guide are designed with early startups in mind, mitigating the most common security risks without requiring significant effort. Many startups begin their journey in the AWS Cloud with a single AWS account. As organizations grow, they migrate to multi-account architectures. The guidance in this guide is designed for single-account architectures, but it helps you set up security controls that are easily migrated or modified as you transition to a multi-account architecture.<br><br>The controls in the AWS SSB are separated into two categories: account and workload. Account controls help keep your AWS account secure. It includes recommendations for setting up user access, policies, and permissions, and it includes recommendations for how to monitor your account for unauthorized or potentially malicious activity. Workload controls help secure your resources and code in the cloud, such as applications, backend processes, and data. It includes recommendations such as encryption and reducing the scope of access.",
    "_": "https://docs.aws.amazon.com/prescriptive-guidance/latest/aws-startup-security-baseline/welcome.html"
  },
  "mapping": {
    "Account": {
      "ACCT.01": ["iam.hasAlternateContact"],
      "ACCT.02": ["iam.noUsersFound", "iam.rootHasAccessKey"],
      "ACCT.03": ["iam.noUsersFound", "iam.hasExternalIdentityProvider", "iam.hasSSORoles"],
      "ACCT.04": ["iam.InlinePolicyFullAccessOneServ", "iam.InlinePolicyFullAdminAccess", "iam.ManagedPolicyFullAccessOneServ", "iam.FullAdminAccess"],
      "ACCT.05": ["iam.rootMfaActive", "iam.mfaActive"],
      "ACCT.06": ["iam.passwordPolicy"],
      "ACCT.07": [],
      "ACCT.08": ["s3.PublicAccessBlock", "s3.S3AccountPublicAccessBlock"],
      "ACCT.09": [],
      "ACCT.10": ["iam.enableCostBudget"],
      "ACCT.11": ["iam.enableGuardDuty", "**iam.guardDutyNotification"],
      "ACCT.12": []
    },
    "Workloads": {
      "WKLD.01": ["ec2.EC2IamProfile", "lambda.lambdaMissingRole"],
      "WKLD.02": [],
      "WKLD.03": [],
      "WKLD.04": [],
      "WKLD.05": [],
      "WKLD.06": [],
      "WKLD.07": [],
      "WKLD.08": ["ec2.EBSEncrypted", "rds.StorageEncrypted"],
      "WKLD.09": [],
      "WKLD.10": [],
      "WKLD.11": ["ec2.SGSensitivePortOpenToAll", "ec2.SGTCPAllOpen", "ec2.SGAllOpen", "ec2.SGAllOpenToAll", "ec2.ELBListenerInsecure", "rds.PubliclyAccessible"],
      "WKLD.12": [],
      "WKLD.13": [],
      "WKLD.14": [],
      "WKLD.15": []
    }
  }
}
